# Декларативное программирование:
# Задача 4: Поиск уникальных элементов в списке.
# Напишите программу, которая создает новый список, содержащий только уникальные элементы из исходного списка.

array = [2, 5, 9, 1, 6, 5, 3, 2]

print(set(array))
